doc/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-09-16 Fri 14:40 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ReMASTER Documentation</title>
<meta name="author" content="Tim Vaughan" />
<meta name="generator" content="Org Mode" />
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="katex/katex.css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">ReMASTER Documentation</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4586515">1. Overview</a>
<ul>
<li><a href="#orgb1772fc">1.1. The name</a></li>
<li><a href="#org9263c15">1.2. License</a></li>
</ul>
</li>
<li><a href="#org9d9a64b">2. Installation</a></li>
<li><a href="#org64c8867">3. Model specification</a>
<ul>
<li><a href="#org0f05315">3.1. Populations</a></li>
<li><a href="#org5f91d48">3.2. Reactions</a>
<ul>
<li><a href="#orgfe20103">3.2.1. Continuous reactions</a></li>
<li><a href="#org77e8e18">3.2.2. Punctual reactions</a></li>
<li><a href="#org589e551">3.2.3. Identifying parents and children</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgcfedb10">4. Trajectory simulation</a></li>
<li><a href="#org4cb83ef">5. Tree simulation</a></li>
<li><a href="#org3957b1b">6. Integrating with BEAST</a></li>
<li><a href="#org00f549d">7. Examples</a></li>
</ul>
</div>
</nav>
<p>
<b><b>Warning: Remaster is still in development and not yet suitable for production use.</b></b>
</p>

<p>
GitHub Repository: <a href="https://github.com/tgvaughan/remaster">https://github.com/tgvaughan/remaster</a>
</p>

<div id="outline-container-org4586515" class="outline-2">
<h2 id="org4586515"><span class="section-number-2">1.</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
ReMASTER is a flexible tool for simulating trajectories
and trees from birth-death and coalescent models commonly used in
phylodynamic inference, as well as some less common models.
</p>

<p>
ReMASTER defines stochastic population models using an intuitive
"reaction" notation borrowed from Chemistry.  Using this notation,
a simple birth-death process on the number of individuals of type $X$
might be expressed using the following pair of reactions:
$$X \overset{\lambda}{\longrightarrow} 2X$$
and
$$X \overset{\mu}{\longrightarrow} 0$$
where in each case the elements on the left-hand side of the arrow
indicate the individual(s) involved in the reaction (the reactants),
and the elements on the right-hand side correspond to the individual(s)
remaining after the reaction has fired.  The symbol above the arrow
represents the rate (probability per unit time) at which the reaction
fires for each available combination of reactants.
</p>

<p>
In order to permit the simulation of reconstructed phylogenies corresponding
to subsets of the whole population, ReMASTER allows users to specify that
one or more of the model populations are "sample" populations.  This means
that sampling processes can be explicitly included in the simulation model.
For instance, by adding the reaction
$$ X \overset{\psi}{\longrightarrow} S$$
where $S$ is defined as a sample population, the birth-death model above becomes the
linear birth-death-sampling model which is the basis of much modern phylodynamic inference.
</p>

<p>
In addition, ReMASTER allows one to define "punctual" reactions which occur
at pre-determined times and fire a fixed or stochastic number of times.
Besides allowing models to include interesting discrete events, this allows
users to pre-specify sample counts and times.
</p>

<p>
Setting up a model in master involves composing an XML input file
describing initial population sizes and the set of reactions governing
their dynamics.  The input file format is quite readable and concise.
For example, the following is a complete XML input file for 
simulating 100 trees under a the above birth-death sampling model with
$\lambda=2$, $\mu=1$ and $\psi=0.1$:
</p>

<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #ff1493;">beast</span> <span style="color: #ff69b4;">version</span>=<span style="color: #61CE3C;">"2.0"</span> <span style="color: #ff69b4;">namespace</span>=<span style="color: #61CE3C;">"beast.core.parameter:beast.core:remaster"</span>&gt;
    &lt;<span style="color: #ff1493;">run</span> <span style="color: #ff69b4;">spec</span>=<span style="color: #61CE3C;">"Simulator"</span> <span style="color: #ff69b4;">nSims</span>=<span style="color: #61CE3C;">"100"</span>&gt;
        &lt;<span style="color: #ff1493;">simulate</span> <span style="color: #ff69b4;">spec</span>=<span style="color: #61CE3C;">"SimulatedTree"</span> <span style="color: #ff69b4;">id</span>=<span style="color: #61CE3C;">"tree"</span>&gt;
            &lt;<span style="color: #ff1493;">trajectory</span> <span style="color: #ff69b4;">spec</span>=<span style="color: #61CE3C;">"StochasticTrajectory"</span> <span style="color: #ff69b4;">id</span>=<span style="color: #61CE3C;">"SIRTrajectory"</span> <span style="color: #ff69b4;">endsWhen</span>=<span style="color: #61CE3C;">"sample&gt;=10"</span>&gt;
                &lt;<span style="color: #ff1493;">population</span> <span style="color: #ff69b4;">spec</span>=<span style="color: #61CE3C;">"RealParameter"</span> <span style="color: #ff69b4;">id</span>=<span style="color: #61CE3C;">"X"</span> <span style="color: #ff69b4;">value</span>=<span style="color: #61CE3C;">"1"</span>/&gt;
                &lt;<span style="color: #ff1493;">samplePopulation</span> <span style="color: #ff69b4;">spec</span>=<span style="color: #61CE3C;">"RealParameter"</span> <span style="color: #ff69b4;">id</span>=<span style="color: #61CE3C;">"sample"</span> <span style="color: #ff69b4;">value</span>=<span style="color: #61CE3C;">"0"</span>/&gt;

                &lt;<span style="color: #ff1493;">reaction</span> <span style="color: #ff69b4;">spec</span>=<span style="color: #61CE3C;">"Reaction"</span> <span style="color: #ff69b4;">rate</span>=<span style="color: #61CE3C;">"2"</span>&gt; X -&gt; 2X &lt;/<span style="color: #ff1493;">reaction</span>&gt;
                &lt;<span style="color: #ff1493;">reaction</span> <span style="color: #ff69b4;">spec</span>=<span style="color: #61CE3C;">"Reaction"</span> <span style="color: #ff69b4;">rate</span>=<span style="color: #61CE3C;">"1"</span>&gt; X -&gt; 0 &lt;/<span style="color: #ff1493;">reaction</span>&gt;
                &lt;<span style="color: #ff1493;">reaction</span> <span style="color: #ff69b4;">spec</span>=<span style="color: #61CE3C;">"Reaction"</span> <span style="color: #ff69b4;">rate</span>=<span style="color: #61CE3C;">"0.1"</span>&gt; X -&gt; S &lt;/<span style="color: #ff1493;">reaction</span>&gt;
            &lt;/<span style="color: #ff1493;">trajectory</span>&gt;
        &lt;/<span style="color: #ff1493;">simulate</span>&gt;

        &lt;<span style="color: #ff1493;">logger</span> <span style="color: #ff69b4;">spec</span>=<span style="color: #61CE3C;">"Logger"</span> <span style="color: #ff69b4;">fileName</span>=<span style="color: #61CE3C;">"simulated.trees"</span>&gt;
            &lt;<span style="color: #ff1493;">log</span> <span style="color: #ff69b4;">idref</span>=<span style="color: #61CE3C;">"tree"</span>/&gt;
        &lt;/<span style="color: #ff1493;">logger</span>&gt;
    &lt;/<span style="color: #ff1493;">run</span>&gt;
&lt;/<span style="color: #ff1493;">beast</span>&gt;
</pre>
</div>

<p>
ReMASTER is a <a href="https://www.beast2.org/">BEAST 2</a> package, and integrates well with that platform.
Simulated ReMASTER trees can be used directly inside of regular BEAST
XML analysis scripts to initialise MCMC states or construct
simulation-based validation studies.
</p>
</div>

<div id="outline-container-orgb1772fc" class="outline-3">
<h3 id="orgb1772fc"><span class="section-number-3">1.1.</span> The name</h3>
<div class="outline-text-3" id="text-1-1">
<p>
"ReMASTER" is a play on the name of an earlier simulation tool, <a href="https://tgvaughan.github.io/MASTER">MASTER</a>.
ReMASTER is a new implementation which is faster, leaner, and more capable
of performing the simulation tasks for which MASTER itself is actually used.
</p>
</div>
</div>

<div id="outline-container-org9263c15" class="outline-3">
<h3 id="org9263c15"><span class="section-number-3">1.2.</span> License</h3>
<div class="outline-text-3" id="text-1-2">
<p>
ReMASTER is free software, and is made available under the terms of
version 3 of the GNU General Public License, the text of which is
available <a href="https://raw.githubusercontent.com/tgvaughan/remaster/master/COPYING">here</a>.  The source code for the project can be found at the
official Github project page: <a href="https://github.com/tgvaughan/remaster">https://github.com/tgvaughan/remaster</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-org9d9a64b" class="outline-2">
<h2 id="org9d9a64b"><span class="section-number-2">2.</span> Installation</h2>
<div class="outline-text-2" id="text-2">
<p>
ReMASTER is a BEAST 2 package and will eventually be available for installation
directly from the standard BEAST 2 package repository.  However, while it is still
in development, installation must be done as follows:
</p>

<ol class="org-ol">
<li>Open BEAUti,</li>
<li>Open the <code>File</code> menu and select <code>Manage packages</code>.</li>
<li>Press the <code>Package repositories</code> button at the bottom of the dialog box, then add the
following URL: <a href="https://tgvaughan.github.io/remaster/package.xml">https://tgvaughan.github.io/remaster/package.xml</a></li>
<li>Press <code>Done</code> to return to the package list.</li>
<li>Select "remaster" from the package list and press the <code>Install/Upgrade</code> button.</li>
</ol>

<p>
ReMASTER should now be available on your system, and running beast
with a ReMASTER input file should perform the corresponding
simulation.
</p>
</div>
</div>

<div id="outline-container-org64c8867" class="outline-2">
<h2 id="org64c8867"><span class="section-number-2">3.</span> Model specification</h2>
<div class="outline-text-2" id="text-3">
<p>
Like MASTER, ReMASTER defines models in terms of <a href="#org0f05315">populations</a> and <a href="#org5f91d48">reactions</a>.
</p>
</div>

<div id="outline-container-org0f05315" class="outline-3">
<h3 id="org0f05315"><span class="section-number-3">3.1.</span> Populations</h3>
<div class="outline-text-3" id="text-3-1">
<p>
A population in ReMASTER is simply a <code>RealParameter</code> (or other
<code>Function</code>) with a specific ID.  The value of the <code>RealParameter</code> is
used as its initial population size in the simulation.
</p>

<p>
For example, the following defines a population named "X" with an initial size
of 10:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #ff1493;">population</span> <span style="color: #ff69b4;">id</span>=<span style="color: #61CE3C;">"X"</span> <span style="color: #ff69b4;">spec</span>=<span style="color: #61CE3C;">"RealParameter"</span> <span style="color: #ff69b4;">value</span>=<span style="color: #61CE3C;">"10"</span>/&gt;
</pre>
</div>

<p>
If the <code>RealParameter</code> is a vector, its elements represent subpopulations.
For example, the following population "Y" has two subpopulations initially
occupied by 1 and 10 individuals, respectively:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #ff1493;">population</span> <span style="color: #ff69b4;">id</span>=<span style="color: #61CE3C;">"Y"</span> <span style="color: #ff69b4;">spec</span>=<span style="color: #61CE3C;">"RealParameter"</span> <span style="color: #ff69b4;">value</span>=<span style="color: #61CE3C;">"1 10"</span>/&gt;
</pre>
</div>

<p>
Populations may also be marked as "sample" populations by using the appropriate
tag:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #ff1493;">samplePopulation</span> <span style="color: #ff69b4;">id</span>=<span style="color: #61CE3C;">"sample"</span> <span style="color: #ff69b4;">spec</span>=<span style="color: #61CE3C;">"RealParameter"</span> <span style="color: #ff69b4;">value</span>=<span style="color: #61CE3C;">"0"</span>/&gt;
</pre>
</div>
<p>
For trajectories, sample populations behave just like any other
population, besides being forbidden from appearing on the reactant
side of a reaction.  individuals of these populations take on a
special meaning when trees are simulated, however, as the production
of a sample corresponds to the creation of a node (internal or
external) in the resulting tree.
</p>
</div>
</div>

<div id="outline-container-org5f91d48" class="outline-3">
<h3 id="org5f91d48"><span class="section-number-3">3.2.</span> Reactions</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Reactions connect zero or more <b>reactant</b> individuals with zero or
more <b>product</b> individuals.  The dynamics that ReMASTER simulates are
simply the result of applying reactions at random or pre-determined times.
</p>

<p>
There are two distinct kinds of reactions which can be specified: "continuous"
reactions and "punctual" reactions."  Continuous are applied continuously
throughout the simulation at pre-defined <i>rates</i> which determine the probability
per unit time for the reaction firing on each of the possible combinations of
reactant individuals.  In contrast, punctual reactions are applied at one
or more pre-defined <i>times</i>. At each of thes times, a punctual reaction may
be applied with some probability to each available combination of
reactants (i.e. the number of times the reaction fires is still
random) or it may be applied a pre-specified number of times.
</p>
</div>

<div id="outline-container-orgfe20103" class="outline-4">
<h4 id="orgfe20103"><span class="section-number-4">3.2.1.</span> Continuous reactions</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Use the following notation to specify a continuous reaction with a fixed rate in the XML:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #ff1493;">reaction</span> <span style="color: #ff69b4;">spec</span>=<span style="color: #61CE3C;">"Reaction"</span> <span style="color: #ff69b4;">rate</span>=<span style="color: #61CE3C;">"2"</span>&gt; S + I -&gt; 2I &lt;/<span style="color: #ff1493;">reaction</span>&gt;
</pre>
</div>

<p>
The rate of a continuous reaction can change at one or more times.  For example,
to specify that the rate should change from 2 to 1.4 at time 4, you can write
the following:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #ff1493;">reaction</span> <span style="color: #ff69b4;">spec</span>=<span style="color: #61CE3C;">"Reaction"</span> <span style="color: #ff69b4;">rate</span>=<span style="color: #61CE3C;">"2 1"</span> <span style="color: #ff69b4;">changeTime</span>=<span style="color: #61CE3C;">"4"</span>&gt; S + I -&gt; 2I &lt;/<span style="color: #ff1493;">reaction</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org77e8e18" class="outline-4">
<h4 id="org77e8e18"><span class="section-number-4">3.2.2.</span> Punctual reactions</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
To specify that a 
</p>
</div>
</div>

<div id="outline-container-org589e551" class="outline-4">
<h4 id="org589e551"><span class="section-number-4">3.2.3.</span> Identifying parents and children</h4>
</div>
</div>
</div>

<div id="outline-container-orgcfedb10" class="outline-2">
<h2 id="orgcfedb10"><span class="section-number-2">4.</span> Trajectory simulation</h2>
</div>

<div id="outline-container-org4cb83ef" class="outline-2">
<h2 id="org4cb83ef"><span class="section-number-2">5.</span> Tree simulation</h2>
</div>

<div id="outline-container-org3957b1b" class="outline-2">
<h2 id="org3957b1b"><span class="section-number-2">6.</span> Integrating with BEAST</h2>
</div>

<div id="outline-container-org00f549d" class="outline-2">
<h2 id="org00f549d"><span class="section-number-2">7.</span> Examples</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tim Vaughan</p>
<p class="date">Created: 2022-09-16 Fri 14:40</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
